tutorials/multiphase/phaseFieldFoam/icoPhase/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

anisotropy
{
    type           anisotropySource;
    active         yes;

    anisotropySourceCoeffs
    {
        selectionMode   all;
        
        tau             0.0003;
        kappa1          0.9;
        kappa2          20;
    }
}

//************************************************************************** //
