tutorials/multiphase/phaseFieldFoam/icoPhase/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;

DT              DT [ 0 2 -1 0 0 0 0 ] 2.25;

tau             tau [ 0 0 1 0 0 0 0 ] 0.0003;

alpha           alpha [ 0 1 0 0 0 0 0 ] 0.015;

c               c [0 0 0 0 0 0 0] 0.02;

N               N [ 0 0 0 0 0 0 0 ] 6;


// ************************************************************************* //
