tutorials/multiphase/phaseFieldFoam/icoPhase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 6.25;

vertices
(
    (-2 -1 -1)  // 0
    ( 1 -1 -1)  // 1
    ( 1  1 -1)  // 2
    (-2  1 -1)  // 3
    (-2 -1  1)  // 4
    ( 1 -1  1)  // 5
    ( 1  1  1)  // 6
    (-2  1  1)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (800 400 1) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    borders
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
