tutorials/multiphase/phaseFieldFoam/icoPhase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue fi 0
);

regions
(
    cylinderToCell
    {
        p1 (0 0 -2.5);
        p2 (0 0  2.5);
        radius 0.125;

        fieldValues
        (
            volScalarFieldValue fi 1
        );
    }
);


// ************************************************************************* //
